<head>
</head>


<h2>LogicSim mode d'emploi : </h2>

<p>Dans la liste de gauche, on trouve les diff&eacute;rentes fonctions, que
l'on peut placer &agrave; l'aide de la sourie sur le plan de travail.</p>

<p>Pour c&acirc;bler une sortie (c&ocirc;t&eacute; droit d'un &eacute;l&eacute;ment),
cliquer sur la sortie et tir&eacute; la connexion jusqu'&agrave;
l'entr&eacute;e d&eacute;sirer (c&ocirc;t&eacute; gauche d'un &eacute;l&eacute;ment).</p>

<p>Sur une connexion existante, il suffis de faire &quot;shift et clic&quot;
pour connecter un autre fil.</p>

<p>Symbole et connexion peuvent &ecirc;tre activ&eacute; par un clic et
effac&eacute; par la touche de suppression.</p>

<p>Pour quelque composant (par exemple les horloges, les monostables, les
afficheurs, les &eacute;tiquettes de texte), on peut modifier quelques
r&eacute;glages, en activant le menu contextuel par un clic droit.</p>

<p>Pour quelques logigrammes (AND, OR, XOR, etc.), On peut modifier le nombre
des entr&eacute;es &agrave; l'aide de la bo&icirc;te de choix. (Sous la liste
des composants).</p>

<p>Les Composant se comportent alors, comme s'ils seraient reli&eacute; de
cette fa&ccedil;on :</p>

<p ><img width=83 height=77 src="images/and4input.gif"><br >
<b>Modification des entr&eacute;es d'un logigramme.</b> 
<img width=204 height=90 src="images/input.gif" align=right valign=top >

<p>Pour inverser une entr&eacute;e, il suffit de s&eacute;lectionner l'option
&quot;entr&eacute;e l'invers&eacute;e&quot; dans le menu de gauche et de
s&eacute;lectionner l'entr&eacute;e que l'on veut inverser. Par le m&ecirc;me
principe, on peut mettre une entr&eacute;e au niveau &quot;haut&quot; ou
&quot;bas&quot;.</p>

<p>Pour remettre une entr&eacute;e normale, il suffit de choisir l'option
&quot;entr&eacute;e normale&quot; et de s&eacute;lectionner l'entr&eacute;e que
l'on d&eacute;sir. </p>

<p>&nbsp;</p>

<h4>Cr&eacute;ation d'un module.</h4>

<p>Un module est un ensemble de composant relier entre eux pour r&eacute;aliser
une fonction pr&eacute;cise, que l'on peut utiliser comme logigramme dans un
autre sch&eacute;ma.</p>

<p>Pour cr&eacute;er un module, il faut d'abord choir la fonction
&quot;cr&eacute;e un module&quot; du menu &quot;module&quot;. Dans la fen&ecirc;tre
de dialogue qui s'ouvre on peut donner les caract&eacute;ristiques du module
que l'on veut cr&eacute;e. </p>

<p>Le nom du module est aussi le nom du fichier correspondant au module.
L'&eacute;tiquette du module correspond &agrave; la description du logigramme
correspondant. </p>

<p>Apr&egrave;s la validation des donn&eacute;es, il se cr&eacute;e automatiquement
deux portes d'entr&eacute; et de sortie. Ces portes correspondent aux
entr&eacute;es et sorties du module cr&eacute;e. </p>

<p>Le c&acirc;blage interne du module doit &ecirc;tre raccord&eacute; ont ces
portes logiques.</p>

<p>Pour tester le module on peut rajouter des boutons en entrer et des led en
sorties. </p>

<p>Lors de l'enregistrement le module serra enregistr&eacute; sous son nom dans
le r&eacute;pertoire module. Apr&egrave;s la sauvegarde, le module appara&icirc;t
dans la liste des portes disponibles et peut &ecirc;tre utilis&eacute; dans un
nouveau sch&eacute;ma... </p>

<p>Par exemple vous pouvez ouvrir le module &quot;FullAdder.mod&quot; du
r&eacute;pertoire &quot;modules&quot;.</p>

<p>Ce module et utilis&eacute; dans le sch&eacute;ma &quot;5 Bit
Adder.lsim&quot; pour l'adition de deux digits sur cinq bits.</p>

<p class=MsoNormal><br>
<img width=420 height=278 src="images/ls1.gif"><br>
<br>
<img width=420 height=278 src="images/ls2.gif"></p>

</div>

</body>

</html>
